KanatERPSukhova.КанатАдаптация/src/Catalogs/РесурсныеСпецификации/РесурсныеСпецификации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="ee5a63d2-90be-4f36-8a88-5415230abebc">
  <name>РесурсныеСпецификации</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
    <hierarchyType>Checked</hierarchyType>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="436cac62-4694-43a2-8d22-669228b1baf1">
    <name>ОсновноеИзделиеКоличествоУпаковок</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="cc79d025-e4b3-4adf-ad53-eda1f76f3bfa">
    <name>ОсновноеИзделиеНоменклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="50617dd7-6ff4-4dc2-a0d1-1996bd1af55b">
    <name>ОсновноеИзделиеХарактеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КАНАТ_ТехнологическаяСпецификация</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Примечание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ДокладнаяЗаписка</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_Основание</name>
    <type>
      <types>CatalogRef.РесурсныеСпецификации</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="dea18009-f98d-468a-859b-cf3cce9196a0">
    <name>СпособРаспределенияЗатратНаВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f541bc89-351d-4def-99c7-bc02b9497244">
    <name>ВариантНазначения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ef8d7a41-0646-43ad-88f6-4a05fdfd4001">
    <name>Описание</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="d7c508eb-b4e9-4a54-9256-56fe64f44bf1">
    <name>НачалоДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c0db759b-cb86-470f-ac1a-4622007748c9">
    <name>КонецДействия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fccdf260-9852-4290-a022-4a8aa7f7f0f4">
    <name>ВыпускПроизвольнымиПорциями</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="052b8eae-f60e-4c3c-abd6-a4695a5e825e">
    <name>МинимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="1b7f922c-a145-4699-8371-53c4af687ca8">
    <name>МногоэтапныйПроизводственныйПроцесс</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e3abe02c-7357-44f4-8c29-1103001fc9a0">
    <name>ЕстьНекратныеНормативыВРЦ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="274549a5-518a-4913-a049-05b30732d5ba">
    <name>ТипПроизводственногоПроцесса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5bbc3dbe-eeea-4b75-9545-caf94f8f036f">
    <name>РазрешитьВыборДляИзделийПобочногоВыхода</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="e1c367fe-c52b-4c0f-a74f-6845403cc761">
    <name>ОптимальнаяПартияВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="add9bf8f-b6e4-499c-97f2-421c3d17eb91">
    <name>ОграниченСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="406ad767-ca83-4ad0-b1f8-9ac8daee6f79">
    <name>МаксимальныйСрокПролеживанияВыходныхИзделий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="606417f4-2092-4500-a40a-6e49ae00544d">
    <name>ОптимальноеКоличествоПередачиМеждуЭтапами</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0f7f6ae2-e8b9-4fce-8fa3-629ee39f2ca5">
    <name>ПечатьМаршрутнойКарты</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6f664e98-6ce5-44b6-b35a-8e83c01a9b69">
    <name>ОсновноеИзделиеВидНоменклатуры</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c90f934b-9c20-478f-85ee-7274cd9979b8">
    <name>ОписаниеУточненияПрименения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fc2e8a86-949a-4e4f-812b-94f43e3fd12e">
    <name>ОсновноеИзделиеУпаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f3124293-0b8d-4882-b23c-439b2566fc63">
    <name>ОсновноеИзделиеЭтап</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8cfece92-bb5d-4623-871a-42563d78d9c0">
    <name>ЕстьВложенныеСпецификации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5c232012-137e-4fe3-a365-c69eecfc553a">
    <name>ДопустимоеПревышениеОптимальнойПартииВыпуска</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="6d9e9276-13e9-4b17-a242-69b99618df3c">
    <name>ВариантПодбораВДокументы</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0634919c-9496-4ed5-8d44-222275fdf51d">
    <name>ЕстьУточняемоеОсновноеИзделие</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="71f3c8a4-5f20-400f-aef5-acbf7a734855">
    <name>ЕстьПараметризацияРесурсов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="02138102-fb2c-4d61-a0ee-ad75034be9fa">
    <name>ЕстьРасчетВероятности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="c225c8c7-cc0e-4917-91b9-de521887536d">
    <name>ОтветственноеПодразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f0ad745f-112b-4b3c-8d90-d1200757685d">
    <name>ИдентификаторВерсииДанных</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f3f60468-b96f-4528-8adc-5b0b567a3e3d">
    <name>МатериалыИУслуги</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="e3112143-6304-49ed-abcf-b14fe2425c34">
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="d938bbe4-fc79-49eb-ba11-f6f1d62d7ab4">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c760a5ad-a536-49ec-816d-fad0d87140f3">
    <name>ВыходныеИзделия</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="2a6c2c71-230f-425a-a0e6-d556c2f47f3a">
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="dee0ba41-dd89-4212-ace9-8a7a209bce5b">
      <name>АлгоритмАвтовыбораХарактеристики</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b1e20410-a0e0-4aba-8122-7aef753d2cd5">
      <name>КоличествоУпаковок</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="71a20cef-31cc-4da2-82e6-195ae04b99d6">
      <name>ТребуетсяУказыватьСерии</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="a9766914-b51b-49c3-854b-6185efea75fc">
      <name>ОписаниеИзделия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="e00a89f7-24ad-4d28-8e86-331ef04bb0d7">
    <name>ВозвратныеОтходы</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
  <tabularSections extendedConfigurationObject="76aa45fe-dde7-48b0-940f-7eaf21bba0cc">
    <name>Трудозатраты</name>
    <objectBelonging>Adopted</objectBelonging>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/ЭтапыПроизводства/ЭтапыПроизводства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="8a5439d8-cc0d-400e-9c24-345aa84acb85">
  <name>ЭтапыПроизводства</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>КАНАТ_Оборудование</name>
    <type>
      <types>CatalogRef.ОбъектыЭксплуатации</types>
    </type>
  </attributes>
  <attributes>
    <name>КАНАТ_ЗаправочныеПараметры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КАНАТ_Показатели</name>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.КАНАТ_ПоказателиОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

KanatERPSukhova.КанатАдаптация/src/Catalogs/РесурсныеСпецификации/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПеред(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24++
	//ПриЧтенииСозданииНаСервере();
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) И
		ЗначениеЗаполнено(Объект.Родитель) И
		Не Объект.КАНАТ_ТехнологическаяСпецификация И
		Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
		
		Отказ = Истина;
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создание обычной спецификации в папке с технологическими спецификациями невозможно";
		Сообщение.Сообщить();
		
		Возврат;
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_09.04.24--
КонецПроцедуры


&НаСервере
Процедура КАНАТ_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24++
	//Спецификация основание
	Если Не Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
		ЭлементОснование = Элементы.Добавить("КАНАТ_Основание",
														 Тип("ПолеФормы"),
														 Элементы.ГруппаЛево);
		ЭлементОснование.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементОснование.ПутьКДанным = "Объект.КАНАТ_Основание";
		ЭлементОснование.ТолькоПросмотр = Истина;
		
		Элементы.ПодменюПечатьОбычное__ДокладнаяЗаписка.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__РасходСырьяМатериалов.Видимость = Ложь;
		Элементы.ПодменюПечатьОбычное__ТехнологическийПроцесс.Видимость = Ложь;
	КонецЕсли;  
		
	Если Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
		
		//Выключаем подбор технологической спецификации
		Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
			ИсключитьАвтоматическийВыборВДокументах = Истина;
			Объект.ВариантПодбораВДокументы = ?(ИсключитьАвтоматическийВыборВДокументах,
				ПредопределенноеЗначение("Перечисление.ВариантыПодбораСпецификацииВДокументы.Вручную"),
				ПредопределенноеЗначение("Перечисление.ВариантыПодбораСпецификацииВДокументы.Автоматически"));
		КонецЕсли;
		
		ЭтаФорма.Заголовок = СтрШаблон("(технологическая) %1", Этаформа.Заголовок);
		Элементы.ИсключитьАвтоматическийВыборВДокументах.Доступность = Ложь;
		Элементы.ГруппаИзмененияСтатуса.Доступность = Ложь;
		
		//Выводим новые элементы этапа
		ГруппаЗаправочныеПараметры = Элементы.Добавить("КАНАТ_ГруппаЭтапЗаправочныеПараметры",
													Тип("ГруппаФормы"),
													Элементы.ПроизводственныйПроцессЭтап);
		ГруппаЗаправочныеПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗаправочныеПараметры.Заголовок = "Заправочные параметры";
		ГруппаЗаправочныеПараметры.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		ГруппаЗаправочныеПараметры.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		
		Элементы.Переместить(ГруппаЗаправочныеПараметры, Элементы.ПроизводственныйПроцессЭтап, Элементы.ЭтапСтраницаОписание);
		
		ЭлементОборудование = Элементы.Добавить("КАНАТ_ЭтапОборудование",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементОборудование.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементОборудование.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Оборудование";
		
		ЭлементЗапПараметры = Элементы.Добавить("КАНАТ_ЭтапЗаправочныеПараметры",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементЗапПараметры.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементЗапПараметры.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_ЗаправочныеПараметры"; 
		ЭлементЗапПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементЗапПараметры.АвтоМаксимальнаяШирина = Ложь;
		ЭлементЗапПараметры.РастягиватьПоВертикали = Ложь;
		ЭлементЗапПараметры.Высота = 4;
		
		ТаблицаПоказатели = Элементы.Добавить("КАНАТ_ЭтапТаблицаПоказатели", Тип("ТаблицаФормы"),ГруппаЗаправочныеПараметры);
		ТаблицаПоказатели.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Показатели";
		
		ТаблицаПоказателиПоказатель  = Элементы.Добавить("КАНАТ_ЭтапТаблицаПоказателиПоказатель",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиПоказатель.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиПоказатель.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Показатели.Показатель";
		
		ТаблицаПоказателиЗначение  = Элементы.Добавить("КАНАТ_ЭтапТаблицаПоказателиЗначение",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиЗначение.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиЗначение.ПутьКДанным = "ПроизводственныйПроцессЭтап.КАНАТ_Показатели.Значение";
		
		//Элементы технологической операции
		ГруппаЗаправочныеПараметры = Элементы.Добавить("КАНАТ_ГруппаОперацияЗаправочныеПараметры",
													Тип("ГруппаФормы"),
													Элементы.ПроизводственныйПроцессОперацияОбычная);
		ГруппаЗаправочныеПараметры.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаЗаправочныеПараметры.Заголовок = "Заправочные параметры";
		ГруппаЗаправочныеПараметры.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
		ГруппаЗаправочныеПараметры.ОтображениеУправления = ОтображениеУправленияОбычнойГруппы.Картинка;
		
		Элементы.Переместить(ГруппаЗаправочныеПараметры, Элементы.ПроизводственныйПроцессОперацияОбычная, Элементы.ОперацияСтраницаОписание);
		
		ЭлементОборудование = Элементы.Добавить("КАНАТ_ОперацияОборудование",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементОборудование.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементОборудование.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Оборудование";
		
		ЭлементЗапПараметры = Элементы.Добавить("КАНАТ_ОперацияЗаправочныеПараметры",
														 Тип("ПолеФормы"),
														 ГруппаЗаправочныеПараметры);
		ЭлементЗапПараметры.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементЗапПараметры.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_ЗаправочныеПараметры"; 
		ЭлементЗапПараметры.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементЗапПараметры.АвтоМаксимальнаяШирина = Ложь;
		ЭлементЗапПараметры.РастягиватьПоВертикали = Ложь;
		ЭлементЗапПараметры.Высота = 4;
		
		ТаблицаПоказатели = Элементы.Добавить("КАНАТ_ОперацияТаблицаПоказатели", Тип("ТаблицаФормы"),ГруппаЗаправочныеПараметры);
		ТаблицаПоказатели.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Показатели";
		
		ТаблицаПоказателиПоказатель  = Элементы.Добавить("КАНАТ_ОперацияТаблицаПоказателиПоказатель",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиПоказатель.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиПоказатель.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Показатели.Показатель";
		
		ТаблицаПоказателиЗначение  = Элементы.Добавить("КАНАТ_ОперацияТаблицаПоказателиЗначение",
															   Тип("ПолеФормы"),
															   ТаблицаПоказатели);
		ТаблицаПоказателиЗначение.Вид = ВидПоляФормы.ПолеВвода;      
		ТаблицаПоказателиЗначение.ПутьКДанным = "ПроизводственныйПроцессОперация.КАНАТ_Показатели.Значение";
		
		//Реквизиты Примечание и Докладная записка
		ЭлементПримечание = Элементы.Добавить("КАНАТ_Примечание",
											  Тип("ПолеФормы"));
		ЭлементПримечание.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементПримечание.ПутьКДанным = "Объект.КАНАТ_Примечание"; 
		ЭлементПримечание.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементПримечание.АвтоМаксимальнаяВысота = Ложь;
		ЭлементПримечание.АвтоМаксимальнаяШирина = Ложь;
		ЭлементПримечание.МаксимальнаяВысота = 3;
		ЭлементПримечание.МаксимальнаяШирина = 71;
		
		Элементы.Переместить(ЭлементПримечание, Элементы.ГруппаДополнительно, Элементы.Описание);
		
		ЭлементДокладнаяЗаписка = Элементы.Добавить("КАНАТ_ДокладнаяЗаписка",
													Тип("ПолеФормы"));
		ЭлементДокладнаяЗаписка.Вид = ВидПоляФормы.ПолеВвода;
		ЭлементДокладнаяЗаписка.ПутьКДанным = "Объект.КАНАТ_ДокладнаяЗаписка"; 
		ЭлементДокладнаяЗаписка.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
		ЭлементДокладнаяЗаписка.АвтоМаксимальнаяВысота = Ложь;
		ЭлементДокладнаяЗаписка.АвтоМаксимальнаяШирина = Ложь;
		ЭлементДокладнаяЗаписка.МаксимальнаяВысота = 3;
		ЭлементДокладнаяЗаписка.МаксимальнаяШирина = 71;
		
		Элементы.Переместить(ЭлементДокладнаяЗаписка, Элементы.ГруппаДополнительно, Элементы.Описание);
		
	Иначе
		
		Элементы.ПодменюСоздатьНаОснованииОбычное__1.Видимость = Ложь;
		
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_08.04.24-- 
	////++Бит Трейгер П.М. 22.10.2024
	//Если ЭтотОбъект.Параметры.ЭтоКопированиеСпецификации = Истина Тогда   //Свойство("ЭтоКопированиеСпецификации")
	//ЭтаФорма.ОсновноеИзделиеНоменклатура = ЭтотОбъект.Параметры.номБит;	
	//ПроцедураПриИзмененииБИТ();
	//КонецЕсли;
	
КонецПроцедуры

//&НаСервере
//Процедура ПроцедураПриИзмененииБИТ()
//КэшированныеЗначения = Неопределено;	
//ОсновноеИзделиеНоменклатураПриИзмененииНаСервере(КэшированныеЗначения);
//ЭтаФорма.Записать();
//КонецПроцедуры        
//--Бит Трейгер П.М. 22.10.202
&НаСервере
&После("ПроизводственныйПроцессПриАктивизацииЭлементаНаСервере")
Процедура КАНАТ_ПроизводственныйПроцессПриАктивизацииЭлементаНаСервере()
	//БИТ_Гурьев_ЧТЗ_3.2_10.04.24++
	
	//БИТ_Гурьев_ЧТЗ_3.2_10.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПередЗаписьюНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24++
	Если Объект.КАНАТ_ТехнологическаяСпецификация Тогда
	
		Если Не ЗначениеЗаполнено(Объект.Родитель) ИЛИ
			(ЗначениеЗаполнено(Объект.Родитель) И Не Объект.Родитель.КАНАТ_ТехнологическаяСпецификация) Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Технологическая спецификация должна находится в технологической группе.";
			Сообщение.ПутьКДанным = "Объект.Родитель";
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;
	
	Если Не Объект.КАНАТ_ТехнологическаяСпецификация Тогда
	
		Если ЗначениеЗаполнено(Объект.Родитель) И Объект.Родитель.КАНАТ_ТехнологическаяСпецификация Тогда
			
			Отказ = Истина;
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "В технологической группе могут находиться только технологические спецификации.";
			Сообщение.ПутьКДанным = "Объект.Родитель";
			Сообщение.Сообщить();
			
		КонецЕсли;
	
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_11.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПослеЗаписиНаСервереПосле(ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24++
	Если Объект.КАНАТ_ТехнологическаяСпецификация Тогда
		ЭтаФорма.Заголовок = СтрШаблон("(технологическая) %1", Этаформа.Заголовок);
	КонецЕсли;
	Если ПараметрыЗаписи.Свойство("НеобходимоПеречитать") И ПараметрыЗаписи.НеобходимоПеречитать Тогда
		ЭтаФорма.Прочитать();
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24--
КонецПроцедуры

&НаСервере
Процедура КАНАТ_ПриЗаписиНаСервереПосле(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24++
	Если Не ЗначениеЗаполнено(Объект.Ссылка)
		И Не Объект.КАНАТ_ТехнологическаяСпецификация
		И ЗначениеЗаполнено(Объект.КАНАТ_Основание) Тогда
		
		ЭтапОбъект = Справочники.ЭтапыПроизводства.СоздатьЭлемент();
		//++Бит Трейгер П.М. 18.11.2024
		ЭтапОбъект.Заполнить(Неопределено);
		//--Бит Трейгер П.М. 18.11.2024
		ЭтапОбъект.Владелец = ТекущийОбъект.Ссылка;
		ЭтапОбъект.Наименование = "Производство";
		ЭтапОбъект.НомерЭтапа = 1;
		
		ЭтапОбъект.Записать();
		
		ПараметрыЗаписи.Вставить("НеобходимоПеречитать", Истина);
	КонецЕсли;
	//БИТ_Гурьев_ЧТЗ_3.2_12.04.24--
КонецПроцедуры

//&НаСервере
//&ИзменениеИКонтроль("ОсновноеИзделиеНоменклатураПриИзмененииНаСервере")
//Процедура КАНАТ_ОсновноеИзделиеНоменклатураПриИзмененииНаСервере(КэшированныеЗначения) Экспорт

//	СтруктураСтроки = ОсновноеИзделиеСпецификацииСтруктурой(ЭтотОбъект);

//	СтруктураДействий = Новый Структура;

//	СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", СтруктураСтроки.Характеристика);
//	СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", СтруктураСтроки.Упаковка);
//	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц", Новый Структура("НужноОкруглять", Ложь));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакВидНоменклатуры", Новый Структура("Номенклатура", "ВидНоменклатуры"));
//	СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));

//	ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтруктураСтроки, СтруктураДействий, КэшированныеЗначения);

//	ОбработатьИзменениеДанныхОсновногоИзделия(ЭтотОбъект, СтруктураСтроки);

//	ЗаполнитьСлужебныеРеквизитыИспользованияСвойствХарактеристик();

//	УправлениеДаннымиОбИзделияхКлиентСервер.ОчиститьНастройкиУточненияПримененияСпецификации(Объект, "Характеристика");

//	ОбновитьИнформациюПоОсновномуИзделиюСпецификации();

//	РеквизитОписанияПартииВыпускаПриИзменении();

//	ПроверитьОчиститьВариантПромежуточногоВыпуска(ЭтотОбъект);

//	НастроитьЗависимыеЭлементыФормы(ЭтотОбъект, "ОсновноеИзделие,ПроизводственныйПроцесс,ВариантПромежуточногоВыпуска");

//КонецПроцедуры
